__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 30, 8, 3)     0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 30, 8, 6)     168         input_3[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 15, 4, 6)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 15, 4, 12)    660         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 30, 1)        0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 30, 1)        0                                            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 7, 2, 12)     0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 30, 30)       3840        input_1[0][0]                    
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 30, 30)       3840        input_2[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 168)          0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 30, 30)       7320        lstm_1[0][0]                     
__________________________________________________________________________________________________
lstm_5 (LSTM)                   (None, 30, 30)       7320        lstm_4[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 250)          42250       flatten[0][0]                    
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 30)           7320        lstm_2[0][0]                     
__________________________________________________________________________________________________
lstm_6 (LSTM)                   (None, 30)           7320        lstm_5[0][0]                     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          25100       dense_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 30)           120         lstm_3[0][0]                     
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 30)           120         lstm_6[0][0]                     
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 100)          400         dense_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 160)          0           batch_normalization_1[0][0]      
                                                                 batch_normalization_2[0][0]      
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 100)          16100       concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 100)          0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 50)           5050        dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 50)           0           dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 100)          5100        dropout_2[0][0]                  
==================================================================================================
Total params: 132,028
Trainable params: 131,708
Non-trainable params: 320
__________________________________________________________________________________________________
